message = """331115111343 5343152442 3211624333154213 32112461233361334261 31 1411631161 3311 24636124656152 1131613326 631132631121112455311126 2143136161 14244352624252 25424463 511336 51111365336152254254 144343213561334252 614143 2443153343 3361 3132134323112624 4333 43214561514233366124 311461 53636151555134354261 236124435155 6243336164"""
# mes = message.replace(' ', '')
message = """152111358513141439312912116146143714147273818800141312861580151421615215251012596314107714059126111211549127824213125405241519110061274146541114034795159114469101013141221234472146115392521371011101810641382112431081371515101315131381212511151590977151285131300121510142611075131211159131281111181273121211081024"""
mes = message

# Створюємо словник для Квадрат Полібія для російського алфавіту


def create_polibius_square():
    alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя.,?"  # Російський алфавіт
    square = {}
    row, col = 1, 1  # Початкові координати

    for letter in alphabet:
        # square[letter] = (col, row)
        square[(col, row)] = letter
        col += 1
        if col > 6:  # 5 стовпців в квадраті Полібія
            col = 1
            row += 1

    return square


# Виведемо створений словник
square = create_polibius_square()
x = 0
y = 0
new = ''
for i in range(len(mes)):
    if mes[i] != ' ' and y == 0:
        y = mes[i]
    elif x == 0 and mes[i] != ' ':
        x = mes[i]
        new += square[(int(y), int(x))]
        y = 0
        x = 0
    elif mes[i] == ' ':
        new += mes[i]
        y = 0
        x = 0

print(new.upper())
